; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_4 ?v4 - type_3 ?v5 - type_1)
 	      (pred_1 ?v6 - object ?v5 - type_1)
	      (pred_3 ?v4 - type_3 ?v1 - type_2)
	      (pred_2 ?v4 - type_3 ?v6 - object ?v1 - type_2))

   (:action op_1
       :parameters  (?v4 - type_3 ?v3 ?v8 - type_1)
       :precondition (and  (pred_4 ?v4 ?v3))
       :effect (and  (pred_4 ?v4 ?v8)
		     (not (pred_4 ?v4 ?v3))))

   (:action op_3
       :parameters (?v4 - type_3 ?v7 - object ?v2 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_1 ?v7 ?v2) (pred_4 ?v4 ?v2) (pred_3 ?v4 ?v1))
       :effect (and (pred_2 ?v4 ?v7 ?v1)
		    (not (pred_1 ?v7 ?v2)) 
		    (not (pred_3 ?v4 ?v1))))

   (:action op_2
       :parameters (?v4 - type_3 ?v7 - object ?v2 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_2 ?v4 ?v7 ?v1) (pred_4 ?v4 ?v2))
       :effect (and (pred_1 ?v7 ?v2)
		    (pred_3 ?v4 ?v1)
		    (not (pred_2 ?v4 ?v7 ?v1)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_09 obj_04 - type_3
obj_01 obj_07 obj_06 obj_11 - type_2
obj_05 obj_12 obj_03 obj_13 - type_1
obj_10 obj_08 obj_02 - object)
(:init
(pred_4 obj_09 obj_05)
(pred_3 obj_09 obj_01)
(pred_3 obj_09 obj_07)
(pred_4 obj_04 obj_12)
(pred_3 obj_04 obj_06)
(pred_3 obj_04 obj_11)
(pred_1 obj_10 obj_05)
(pred_1 obj_08 obj_03)
(pred_1 obj_02 obj_05)
)
(:goal
(and
(pred_1 obj_10 obj_13)
(pred_1 obj_08 obj_13)
(pred_1 obj_02 obj_03)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_09 obj_03) (pred_4 obj_04 obj_03))))
    (always (not (and (pred_4 obj_09 obj_13) (pred_4 obj_04 obj_13))))
  )
)
)

; plan
1. (op_3 obj_09 obj_10 obj_05 obj_07)
   deleted: (pred_1 obj_10 obj_05) (pred_3 obj_09 obj_07)
   added: (pred_2 obj_09 obj_10 obj_07)
   goals met: 0 of 3
2. (op_1 obj_04 obj_12 obj_05)
   deleted: (pred_4 obj_04 obj_12)
   added: (pred_4 obj_04 obj_05)
   goals met: 0 of 3
3. (op_3 obj_04 obj_02 obj_05 obj_11)
   deleted: (pred_1 obj_02 obj_05) (pred_3 obj_04 obj_11)
   added: (pred_2 obj_04 obj_02 obj_11)
   goals met: 0 of 3
4. (op_1 obj_09 obj_05 obj_13)
   deleted: (pred_4 obj_09 obj_05)
   added: (pred_4 obj_09 obj_13)
   goals met: 0 of 3
5. (op_2 obj_09 obj_10 obj_13 obj_07)
   deleted: (pred_2 obj_09 obj_10 obj_07)
   added: (pred_1 obj_10 obj_13) (pred_3 obj_09 obj_07)
   goals met: 1 of 3
6. (op_1 obj_04 obj_05 obj_03)
   deleted: (pred_4 obj_04 obj_05)
   added: (pred_4 obj_04 obj_03)
   goals met: 1 of 3
7. (op_2 obj_04 obj_02 obj_03 obj_11)
   deleted: (pred_2 obj_04 obj_02 obj_11)
   added: (pred_1 obj_02 obj_03) (pred_3 obj_04 obj_11)
   goals met: 2 of 3
8. (op_3 obj_04 obj_08 obj_03 obj_06)
   deleted: (pred_1 obj_08 obj_03) (pred_3 obj_04 obj_06)
   added: (pred_2 obj_04 obj_08 obj_06)
   goals met: 2 of 3
9. (op_1 obj_09 obj_13 obj_05)
   deleted: (pred_4 obj_09 obj_13)
   added: (pred_4 obj_09 obj_05)
   goals met: 2 of 3
10. (op_1 obj_04 obj_03 obj_13)
   deleted: (pred_4 obj_04 obj_03)
   added: (pred_4 obj_04 obj_13)
   goals met: 2 of 3
11. (op_2 obj_04 obj_08 obj_13 obj_06)
   deleted: (pred_2 obj_04 obj_08 obj_06)
   added: (pred_1 obj_08 obj_13) (pred_3 obj_04 obj_06)
   goals met: 3 of 3
